app/views/blogs/show.html.haml

SELECT `entries`.* FROM `entries` WHERE `entries`.`blog_id` = 1
---
    %tbody
      - @blog.entries.each do |entry|