app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`title`, `created_at`, `updated_at`) VALUES ('TestBlog', '2015-07-18 06:51:31', '2015-07-18 06:51:31')

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE `blogs` SET `title` = 'TestBlog1', `updated_at` = '2015-07-22 16:38:52' WHERE `blogs`.`id` = 1

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 1

    def set_blog
      if Blog.exists?(id: params[:id])
        # @blog = Blog.find(params[:id])
        @blog = Blog.where("id = #{params[:id]}").first
---
SELECT  1 AS one FROM `blogs` WHERE `blogs`.`id` IN (SELECT `blogs`.`id` FROM `blogs`) LIMIT 1
SELECT  `blogs`.* FROM `blogs` WHERE (id = 4)  ORDER BY `blogs`.`id` ASC LIMIT 1
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1