app/controllers/comments_controller.rb

  def approve
    @comment.status = 'approved'
    respond_to do |format|
      if @comment.save
---
UPDATE `comments` SET `status` = 'approved', `updated_at` = '2015-07-22 17:56:51' WHERE `comments`.`id` = 2

  def create
    @comment = Comment.new(comment_params)
    @comment.status = 'unapproved'
    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`body`, `entry_id`, `status`, `created_at`, `updated_at`) VALUES ('entry1-1-comment2', 19, 'unapproved', '2015-07-22 18:36:38', '2015-07-22 18:36:38')