app/controllers/entries_controller.rb

  def index
    @entries = Entry.where(blog_id: params[:blog_id])
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`blog_id` IS NULL

  def show
    @blog = @entry.blog
    @comments = @entry.comments.all
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`entry_id` = 19

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO `entries` (`title`, `body`, `blog_id`, `created_at`, `updated_at`) VALUES ('article1', 'This is article1', 1, '2015-07-18 06:53:00', '2015-07-18 06:53:00')

  def update
    respond_to do |format|
      if @entry.update(entry_params)
---
UPDATE `entries` SET `title` = 'article2-2-edited', `body` = 'article2-2-edited', `updated_at` = '2015-07-19 21:18:31' WHERE `entries`.`id` = 8

  def destroy
    blog_id = @entry.blog_id

    @entry.destroy
---
DELETE FROM `entries` WHERE `entries`.`id` = 11

    def set_entry
      @entry = Entry.find(params[:id])
---
SELECT  `entries`.* FROM `entries` WHERE `entries`.`id` = 11 LIMIT 1